[
    {
        "Titles": "LG : Chem to Participate in NPE 2024 in North America",
        "Text": "\"Targeting the North American Market with Eco-friendly and High-Value Products\"\nLG Chem to Participate in NPE 2024 in North America\n\n Showcases eco-friendly and high-value products for five days at North America's largest plastics expo starting June 6th.\n\n Displays over 60 product types in the largest booth among Korean companies, featuring dedicated meeting rooms and a lounge for clients.\n\n Kug Lae Noh, Head of Petrochemicals Company at LG Chem\n\"NPE 2024 will serve as a critical juncture for introducing LG Chem's eco-friendly and high-value strategic products in the North American market.\"\n\nLG Chem is set to penetrate the North American market by participating in NPE 2024, the largest plastics trade show in North America.\n\nFrom June 6th, LG Chem will showcase eco-friendly and high-value products under the theme of \"The Sustainable and Innovative Solutions\" at NPE 2024, held in Orlando, Florida, USA, for five days.\n\nNPE 2024, hosted by The Plastics Industry Association, is considered one of the top three chemical industry expos globally, alongside CHINAPLAS (CPS) in China and K show in Germany.\n\nLG Chem will operate a booth spanning 334 square meters (approximately 101 pyeong), the largest among Korean companies, featuring over 60 types of products. The company will also maintain six dedicated meeting rooms and a business lounge to facilitate communication with clients.\n\nAt this exhibition, LG Chem is actively targeting the North American eco-friendly market by operating two \"LETZero zones\" within the booth. Over 40% of LG Chem's products on display are eco-friendly, highlighting its commitment to sustainability.\n\nThe booth features distinct zones including the \"LETZero zone\" with compostable plastics and bio-based materials, the \"Mobility zone\" showcasing EV batteries and charging materials, and the \"Living zone\" which presents plastics made using carbon dioxide and materials produced through eco-friendly fermentation processes.\n\nAmidst strengthening environmental regulations and a shift toward eco-friendly plastics in advanced economies including the U.S. and Europe, the eco-friendly market is thriving, with states across North America enhancing regulations to ensure all disposable packaging and utensils are recyclable or compostable.\n\nKug Lae Noh, Head of Petrochemicals Company at LG Chem, stated, \"NPE 2024 will serve as a critical juncture for introducing LG Chem's eco-friendly and high-value strategic products in the North American market.\"\n\nFurthermore, LG Chem is accelerating its penetration into the North American market with the establishment and operation of an ABS compound factory and a Customer Solution Center in Ohio, USA.\nAttachments\nDisclaimer\nLG Corp. published this content on 08 May 2024 and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on 08 May 2024 04:05:05 UTC.\n\nWilliam Cho, LG CEO: Pivot to EV, metavers and services\nSeptember 26, 2023 at 04:16 am EDT\nBest financial\nportal\n+951% of historical\nperformance\n\n+ 950,000\nmembers\nQuick & easy\ncancellation\nOur Experts\nare here for you\nOUR EXPERTS ARE HERE FOR YOU\nMonday - Friday 9am-12pm / 2pm-6pm GMT + 1",
        "Scoop": "LG Chem has been invited to participate in the largest North American trade show, Npe 2024, which runs from June 6th to June 7th. At the show, the company will display its \"eco-friendly\" and \"high-value\" products in a booth that will serve as an introduction to North America. Kug lae noh, head of petrochemicals company at Lg Chem tells him that NPE 20 24 is a great opportunity for them to introduce their high-value and eco-friendly products to the North American marketplace."
    },
    {
        "Titles": "Midea MHELIOS Showcases Revolutionary Smart Home Energy Solutions at Solar & Storage Live London 2024",
        "Text": "FREE Breaking News Alerts from StreetInsider.com!\nStreetInsider.com Top Tickers, 5/8/2024\nLondon, United Kingdom--(Newsfile Corp. - May 7, 2024) - At the prestigious Solar & Storage Live London, Midea MHELIOS captivated attendees with its innovative smart home energy management system, set to redefine how households manage and consume energy. As a global leading technology group, Midea demonstrated its commitment to sustainable, efficient, and intelligent energy ecosystems.\n\nDuring the event, Midea showcased the MHELIOS energy management system. As for the energy storage part, the system is equipped with Lithium Iron Phosphate (LFP) cells for robust safety and efficiency, capable of 6000 cycles at 100% Depth of Discharge. These systems guarantee zero electricity waste and extended battery life, with the ability to switch to backup power within 20 milliseconds during outages, ensuring continuous energy supply and potential cost savings. Complementing these, the MHELIOS Home M1-S Single-Phase Hybrid Inverter, featuring 200% PV oversizing and low startup voltage, enhances solar energy utilization.\nMidea also organized a series of lectures and workshops that prompted extensive discussions among industry stakeholders. Notable sessions included \"Midea MHELIOS - A New Integrated Energy Management and Energy Consumption Solution for the UK Energy Market\" and \"Battery Storage and Inverter Installation and Commissioning,\" which resonated deeply with local distributors and installers.\nMidea's partnership with Q Energy has been a focal point, showcasing their joint efforts to cultivate a comprehensive industry ecosystem. This collaboration enhances the user experience by integrating diverse technologies and fostering a shared commitment to a sustainable energy future. MHELIOS is always an open platform that welcomes more and more brands to build its ecosystem.\nAs Midea continues to lead the way in smart energy management, the MHELIOS system represents not just a step forward in home energy solutions but also a leap towards a more sustainable and energy-efficient future, truly embodying the essence of innovation at Midea.\nFor more information about Midea and its MHELIOS Energy Management System, please contact:\nMedia Contact\nCompany Name: Midea\nContact Person: Lorca Wei\nEmail: weihf32@midea.com\nState: Guangdong\nCountry: China\nWebsite: https://www.midea.com/global\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/208214\n\nReceive full access to all new and archived articles, unlimited portfolio tracking, e-mail alerts, custom newswires and RSS feeds - and more!",
        "Scoop": "Midea, a leading manufacturer of energy-efficiency and clean energy products, has announced its entry into the European market with the launch of its new home energy management solution, MHELIOs. At the event, midea shows off its new system, which includes Lithium iron phosphate battery cells for strong safety and efficient performance, as well as its Home M1S single-phase inverter. The company also announces that it has a partnership with Qu Energy, one of Europe's largest electric power companies, to further drive its innovation into the future."
    },
    {
        "Titles": "Philips Shareholders Approve All Proposals at the AGM 2024",
        "Text": "Royal Philips (NYSE: PHG, AEX: PHIA) is a leading health technology company focused on improving peoples health and well-being through meaningful innovation. (Image courtesy of Philips International B.V.)\n\nAmsterdam, the Netherlands, May 7 (Korea Bizwire)  Royal Philips (NYSE: PHG, AEX: PHIA), today announced that its shareholders approved all proposals at the Annual General Meeting of Shareholders (AGM) 2024, including:\nFeike Sijbesma, Chairman of Philips Supervisory Board, said: I am very pleased with the re-appointment of Peter and the appointment of Benot, who has extensive experience with large and global industrial companies. With our highly knowledgeable and experienced members, the composition of our Supervisory Board is very strong and well positioned to fulfill our vital duty of advising, challenging, and supporting Management in executing Philips strategy, and it is an honor to serve a second term leading this Board.\nI would also like to welcome Charlotte to Philips. She will join Philips Board of Management on October 1, and fulfill the role of Chief Financial Officer. Her strong MedTech knowledge and extensive finance experience, coupled with her energy and passion for the healthcare industry, make her an ideal fit for the role. Charlotte will work with Abhijit, Philips current Chief Financial Officer, until October, ensuring a smooth transition. I would also like to thank Abhijit in advance for his tremendous contribution to Philips over the last 38 years, and more particularly during his nine years as Chief Financial Officer.\nRoy Jakobs, CEO of Royal Philips said: I want to congratulate our Chairman Feike with his re-appointment. Together with Peter and Benot, as well as the other Supervisory Board members, they represent the best in the industry to provide oversight and valuable insights to Management in executing Philips 2023-2025 plan to create value with sustainable impact for all stakeholders. We look forward to a continued strong and successful collaboration, as we aim to improve the health and well-being of people through meaningful innovation.\nAll resolutions taken at the AGM 2024:\n\n\n\n\nFurther details about the dividend can be found via this link, and additional information on the composition of the Board of Management, the Executive Committee and the Supervisory Board can be found here. Philips 2023 financial statements are included in its Annual Report 2023 that was published on February 20, 2024.\nFor more information about Philips AGM 2024, please click on this link.\nFor further information, please contact:\nElco van Groningen\nPhilips External Relations\nTel.: +31 6 8103 9584\nE-mail: elco.van.groningen@philips.com\nDorin Danu\nPhilips Investor Relations\nTel.: +31 20 59 77055\nE-mail: dorin.danu@philips.com\nAbout Royal Philips\nRoyal Philips (NYSE: PHG, AEX: PHIA) is a leading health technology company focused on improving peoples health and well-being through meaningful innovation. Philips patient- and people-centric innovation leverages advanced technology and deep clinical and consumer insights to deliver personal health solutions for consumers and professional health solutions for healthcare providers and their patients in the hospital and the home. Headquartered in the Netherlands, the company is a leader in diagnostic imaging, ultrasound, image-guided therapy, monitoring, and enterprise informatics, as well as in personal health. Philips generated 2023 sales of EUR 18.2 billion and employs approximately 69,100 employees with sales and services in more than 100 countries. News about Philips can be found at www.philips.com/newscenter.\nAttachment\nSource: Philips International B.V. via GLOBE NEWSWIRE\n\nYour email address will not be published. Required fields are marked *\nName *\nEmail *\nWebsite\nComment\nYou may use these HTML tags and attributes: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <strike> <strong>\n\n\nThe Korea Bizwire is committed to reporting on \"uniquely Korean\" stories for our readers. But we also provide enhanced coverage of useful news from all over the world if we find them of interest or relevance to our global audience.\nKobiz Media, the parent company of this site, offers highly competent press release distribution and localization services aimed at South Korea -- an increasingly important and attractive market for global businesses who want to have an upper hand in the Asia Pacific region since Korea serves as a stepping-stone for forward-looking brands future success in these lucrative markets. We wish you all good luck for extraordinary success in your businesses and life.\nUsername:\nPassword:\nLOST YOUR PASSWORD?",
        "Scoop": "Philips announces that its Board of Trustees has reappointed Peter Feike as the company's new Chief Financial Officer and that Charlotte will join the company on October 1, as well as serve as its CFO until October. The company looks forward to continuing strong and successful cooperation as it aims to improve people health and well being through meaningful innovation"
    }
]