{"Titles":"Boffi Laundry at Auckland Experience Centre & fabric care"}
{"Text":""}
{"Text":"14\/05\/2024"}
{"Text":"Fisher & Paykel"}
{"Text":"Boffi Laundry"}
{"Text":"The architecture of fabric care"}
{"Text":"Wardrobe details"}
{"Text":"Laundry details"}
{"Text":" "}
{"Text":"Fabric Care"}
{"Text":"Love your laundry"}
{"Text":"Ultimate fabric care solutions"}
{"Text":"The science of fabric care"}
{"Text":" "}
{"Text":"Discover products that suit your style and create a list of the items you like or want most."}
{"Text":"Search through our latest projects and articles to find your inspiration for your next project"}
{"Text":"Join the community and give your insight into projects and news"}
{"Text":""}
{"Titles":"Haier Appliance Profits Soar As Revenues Climb, New OZ Developed Energy Washing Machine Contributing"}
{"Text":"As appliance brand including Electrolux and LG Electronics struggle to grow revenues in both Australia and worldwide, Chinese appliance brand Haier has delivered a 6% jump in revenues, and a 20.16% jump in profits during the last quarter 2024."}
{"Text":"The company that also owns the premium appliances brand Fisher & Paykel brand claims that international markets made “notable contributions” to their growth."}
{"Text":"The business achieved a 4% increase in overseas revenue, with a double-digit operating profit which was an increase over previous years during the past quarter."}
{"Text":"Haier’s annual international sales are now outpacing the market both in terms of size and growth."}
{"Text":"Overseas revenue soared 8% year-on-year to A$28.3 billion, US revenue climbed 4%, Europe jumped 24%, and local Chinese revenue was up 7% for the year."}
{"Text":"Facing softening demand in the major home appliance sector in Europe where brands such as Miele are struggling and, in the USA, where LG and Electrolux are facing significant declines, Haier proactively developed and introduced a flagship product tailored to the local market, leading to growth and increased sales."}
{"Text":"At the Spring Canton Fair in April 2024, Haier Smart Home unveiled the “X11 washing machine,” a direct response to energy constraints being placed on appliance brands operating in Europe, some of those constraints are expected to be rolled out in Australia as the Federal Government look for more energy saving programs."}
{"Text":"The new washing machine was engineered through collaborative efforts across various R&D centres including Australia."}
{"Text":"It now delivers 50% greater energy efficiency than the highest European Class-A standards, which management claim underscores the company´s commitment to innovation and sustainability in appliance technology."}
{"Text":"Profitability has been improved due to the introduction of new systems that has led to improved efficiencies across marketing, logistics, and warehouse operations, resulting in a reduced selling expense ratio of 13.1% in Q1 2024."}
{"Text":"This corresponds to a decrease of 0.5 percentage points year-over-year."}
{"Text":"Furthermore, the strategic adoption of digital tools has also refined the administrative expense ratio, which decreased by 0.3 percentage points compared to Q1 2023, achieving a new low of 3.2%. These enhancements reflect Haier Smart Home’s commitment to leveraging digital advancements to streamline operations and reduce costs."}
{"Text":"Shares gained 7.8% on the news with analysts upgraded their earnings per share estimates, suggesting that there has been a clear increase in optimism towards Haier Smart Home following the release of their latest results."}
{"Text":"The business claims that “Despite escalating competition and a volatile external environment, Haier Smart Home’s performance in the first quarter of 2024 has notably exceeded public expectations."}
{"Text":"They claimed that this “Demonstrated their robust resilience and significant growth potential."}
{"Text":"Looking ahead, the company is committed to continuous improvements in cost reduction and operational efficiency through ongoing digitalization efforts. Additionally, by expanding its global presence, Haier Smart Home is poised to seize further development opportunities, paving the way for sustained high-quality growth across its markets”."}
{"Text":"According to management, Australia is seen as a growth market."}
{"Text":"In Australia, recently we revealed that LG Electronics sales had fallen 21% during the past year and that Electrolux global sales decreased by 3.7% this year mainly driven by negative price."}
{"Text":"Weaker market demand resulted in lower volumes for the Swedish Group."}
{"Text":""}
{"Text":"02 9002 5900"}
{"Text":"info@channelnews.com.au"}
{"Text":"Level 1, 275 Alfred Street North Sydney NSW 2060 Australia"}
{"Text":""}
{"Titles":"LG India celebrates 27 years with ‘Life’s Good Offer’ on home appliances"}
{"Text":"Fone Arena"}
{"Text":"The Mobile Blog"}
{"Text":""}
{"Text":"LG Electronics is marking its 27-year journey in India with the ‘Life’s Good Offer.’ With a focus on home appliances and entertainment products, LG aims to enhance every home experience."}
{"Text":"LG Home Appliances: LG offers a range of appliances including ACs, refrigerators, washing machines, water purifiers, microwaves, and dishwashers."}
{"Text":"LG Home Entertainment: Dive into entertainment with LG’s TVs, speakers, and projectors, available in various sizes and technologies like OLED, QNED, and NanoCell."}
{"Text":"As part of the Life’s Good offers, customers can get up to 27% cashback on select debit and credit card transactions."}
{"Text":"The ‘Life’s Good Offer’ is valid from May 12th, 2024, to June 11th, 2024, or until stocks last. Visit your nearest LG authorized retailer or LG’s official website for more information."}
{"Text":"Speaking about the 27-year milestone, Hong Ju Jeon, MD of LG Electronics India, said,"}
{"Text":"Today signifies a momentous milestone for LG Electronics. As we commemorate 27 years of innovation, we reflect on our journey of pushing boundaries, pioneering new technologies, and enriching lives. We extend our heartfelt gratitude to our customers for their unwavering trust and support, which have been the bedrock of our success. Moving forward, we are committed to delivering excellence, enhancing experiences, and fostering positive change in the world."}
{"Text":""}
